-module(robot_chat).

-compile(export_all).
-include("common.hrl").
-include("record.hrl").

%%----------------------  自动聊天机数据  ----------------------
-define(AUTO_CHAT_LIST,		[
								<<"伟大的中国共产党">>,
								<<"跟随失败,队长不能自己跟随自己.">>,
								<<"石家庄在下雪">>,
								<<"是鹅毛大雪">>,
								<<"像是宰了一群鹅">>,
								<<"拔了好多鹅毛">>,
								<<"也不装进袋子里">>,
								<<"像是羽绒服破了">>,
								<<"也不缝上">>,
								<<"北京也在下雪">>,
								<<"不是鹅毛大雪">>,
								<<"是白沙粒">>,
								<<"有些像白砂糖">>,
								<<"有些像碘盐">>,
								<<"廊坊夹在石家庄和北京之间">>,
								<<"廊坊什么雪也不下">>,
								<<"看不到鹅毛">>,
								<<"也看不到白砂糖和碘盐">>,
								<<"廊坊只管阴着天">>,
								<<"像一个女人吊着脸">>,
								<<"说话尖酸、刻薄">>,
								<<"还冷飕飕的">>,
								<<"汉皇①重色思倾国，御宇②多年求不得。杨家有女初长成，养在深闺人未识。">>, 
								<<"天生丽质难自弃，一朝选在君王侧。回眸一笑百媚生，六宫粉黛无颜色。 ">>,
								<<"春寒赐浴华清池，温泉水滑洗凝脂。侍儿扶起娇无力，始是新承恩泽时。 ">>,
								<<"云鬓花颜金步摇，芙蓉帐暖度春宵。春宵苦短日高起，从此君王不早朝。 ">>,
								<<"承欢侍宴无闲暇，春从春游夜专夜。 后宫佳丽三千人，三千宠爱在一身。 ">>,
								<<"金屋妆成娇侍夜，玉楼宴罢醉和春。姊妹弟兄皆列土，可怜光彩生门户③。">>,
								<<"遂令天下父母心，不重生男重生女。骊宫高处入青云，仙乐风飘处处闻。 ">>,
								<<"缓歌谩舞凝丝竹，尽日君王看不足。渔阳鼙鼓④动地来，惊破霓裳羽衣曲。">>,
								<<"九重城阙烟尘生，千乘万骑西南行。翠华摇摇行复止，西出都门百余里。 ">>,
								<<"六军不发无奈何，宛转蛾眉马前死。花钿委地无人收，翠翘金雀玉搔头。 ">>,
								<<"君王掩面救不得，回看血泪相和流。黄埃散漫风萧索，云栈萦纡登剑阁。 ">>,
								<<"峨嵋山下少人行，旌旗无光日色薄⑤。蜀江水碧蜀山青，圣主朝朝暮暮情。 ">>,
								<<"行宫见月伤心色，夜雨闻铃肠断声。 天旋地转回龙驭，到此踌躇不能去。 ">>,
								<<"马嵬坡下泥土中，不见玉颜空死处。君臣相顾尽沾衣，东望都门信⑥马归。">>,
								<<"归来池苑皆依旧，太液芙蓉未央柳。芙蓉如面柳如眉，对此如何不泪垂。 ">>,
								<<"春风桃李花开日，秋雨梧桐叶落时。 西宫南内多秋草，落叶满阶红不扫。 ">>,
								<<"梨园弟子白发新，椒房阿监青娥老。夕殿萤飞思悄然，孤灯挑尽未成眠。 ">>,
								<<"迟迟钟鼓初长夜，耿耿星河欲曙天。 鸳鸯瓦冷霜华重，翡翠衾寒谁与共。 ">>,
								<<"悠悠生死别经年，魂魄不曾来入梦。 临邛道士鸿都客，能以精诚致魂魄。 ">>,
								<<"为感君王辗转思，遂教方士殷勤觅。排空驭气奔如电，升天入地求之遍。 ">>,
								<<"上穷碧落⑦下黄泉，两处茫茫皆不见。忽闻海上有仙山，山在虚无缥渺间。 ">>,
								<<"楼阁玲珑五云起，其中绰约多仙子。中有一人字太真，雪肤花貌参差是。 ">>,
								<<"金阙西厢叩玉扃⑧，转教小玉报双成。闻道汉家天子使，九华帐里梦魂惊。 ">>,
								<<"揽衣推枕起徘徊，珠箔银屏迤逦开⑨。云鬓半偏新睡觉，花冠不整下堂来。 ">>,
								<<"风吹仙袂飘飘举，犹似霓裳羽衣舞。玉容寂寞泪阑干⑩，梨花一枝春带雨。">>,
								<<"含情凝睇谢君王，一别音容两渺茫。昭阳殿里恩爱绝，蓬莱宫中日月长。 ">>,
								<<"回头下望人寰处，不见长安见尘雾。惟将旧物表深情，钿合金钗寄将去。 ">>,
								<<"钗留一股合一扇，钗擘黄金合分钿。但教心似金钿坚，天上人间会相见。 ">>,
								<<"临别殷勤重寄词，词中有誓两心知。 七月七日长生殿，夜半无人私语时。 ">>,
								<<"在天愿作比翼鸟，在地愿为连理枝。 天长地久有时尽，此恨绵绵无绝期。">>,
								<<"明年上国富春光">>,
								<<"朝廷自昔选才良">>,
								<<"时平空山老壮士">>,
								<<"代言直似汉文章">>,
								<<"生来自秀培来秀">>,
								<<"日移花影上窗香">>,
								<<"快意一时荷叶雨">>,
								<<"乐来一顾遇孙阳">>,								
								<<"メールアドレス">>,
								<<"バックアップファイルのパスを入力して下さい">>,
								<<"項目を埋めて Jabber User を検索して下さい">>,
								<<"ユーザー統計の取得">>,
								<<"は提携が変更されたためキックされました">>,								
								<<"该点不可行走！">>
							]).


handle(PlayerId, Socket) -> 
	Cmds = [11010, 11020, 11030, 11040, 11050, 11060],
	Chat_List = ?AUTO_CHAT_LIST,
	Msg = tool:to_list(lists:nth(random:uniform(length(Chat_List)), Chat_List)), 
	Cmd = lists:nth(random:uniform(length(Cmds)), Cmds),
%% io:format("~s_~p: ~p~n", [misc:time_format(now()), ?MODULE, [Cmd, PlayerId, Socket]]), 
	handle_action(Cmd, PlayerId, Socket, Msg),
	ok.

handle_action(11080, _PlayerId, Socket, Msg) ->
	Msg1 = tool:to_binary(Msg),
    Len1 = byte_size(Msg1),
    Data = <<1:8, Len1:16, Msg1/binary>>,	
	gen_tcp:send(Socket,robot:pack(11080, Data)),
	ok;

handle_action(Cmd, _PlayerId, Socket, Msg) ->
	Msg1 = tool:to_binary(Msg),
    Len1 = byte_size(Msg1),
    Data = <<Len1:16, Msg1/binary>>,	
	gen_tcp:send(Socket,robot:pack(Cmd, Data)),	
	ok.

