-define(ETS_PLAYER_ACTIVITY, ets_player_activity).	%%玩家活跃度数据表
-define(PLAYER_BASE_ACTIONS, [0,0,0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0,0,0, 0]).	%%玩家活跃度原始(基础)数据

%% 1.完成1次最高等级副本任务；2.完成1次最高等级氏族任务；3.完成1次诛邪；4.购买1次商城物品；5.完成30分钟高级挂机；
%% 6.完成1次远古试炼；7.出售10个庄园果实；8.完成1次运镖任务；9.完成仙侣情缘任务；10.完成1次跑商任务
%% 11.完成温柔一刀任务；12.累计在线3小时；13.完成3次封神帖任务；14.完成部落荣誉任务；15.通关封神台12层；
%% 16.完成1次修为任务；17.完成1次日常守护任务；18.参加1次智力答题；19.进入1次温泉；20.使用3个仙桃
%% 21.进入1次镇妖台
-define(ACTIVITY_FINISH_NUM, [1,1,1,1,1,1,10,1,1,1, 1,180,3,1,1,1,1,1,1,3, 1]).	%%玩家完成活动的次数条件
-define(ACTIVITY_FINISH_GET, [10,10,10,10,10,10,10,10,10,10, 10,10,10,10,10,10,10,10,10,10, 10]).%%各个活动完成后得到的活跃度值
-define(ACTIVITY_GOODS, [0,0,0,0]).											%%活跃度奖励的物品领取默认数据, 0:没领取，1：已经领取
-define(ACTIVITY_GOODS_NEED, [{31003,30}, {31004,70}, {31005,120}, {31006,180}]).
-define(ONLINE_TIME_BASE, 300).

-record(player_activity, {pid = 0,						%%玩家ID
						  act = 0,						%%玩家活跃值
						  retime = 0,					%%最近更新时间
						  actions = [],					%%活跃度数据
						  goods = ?ACTIVITY_GOODS		%%活跃度奖励的物品领取情况
						 }).


